fix: gitignore, Readme
